# BDA Lab Quiz 1 - 20 Minutes

* Create a new database "NorthWind" using the provided tar file.
* Follow all the steps provided below to solve the Quiz

### Northwind Database

Northwind database is a completely normalized database created by Microsoft for training and educational purpose. The ERD diagram for this Dataset is shown below.

<img src='Data/Northwind ERD.png'>

#### 1- Connect to the local database where `Northwind` is loaded

In [1]:
%load_ext sql

DB_ENDPOINT = "127.0.0.1"
DB = 'Northwind1'
DB_USER = 'postgres'
DB_PASSWORD = 'ali123ali'
DB_PORT = '5432'

# postgresql://username:password@host:port/database
conn_string = "postgresql://{}:{}@{}:{}/{}" \
                        .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)

print(conn_string)

postgresql://postgres:ali123ali@127.0.0.1:5432/Northwind1

In [2]:
%sql $conn_string

##### 1- Find out all the procuts that have atleast 20 units in stock [1 Mark]

In [3]:
%%time
%%sql
select productname, unitsInStock
from products 
where unitsInStock >=20
limit 10;

 * postgresql://postgres:***@127.0.0.1:5432/Northwind1
10 rows affected.
Wall time: 7.8 ms

[('chai', 39),
 ("chef anton's cajun seasoning", 53),
 ("grandma's boysenberry spread", 120),
 ('mishi kobe niku', 29),
 ('ikura', 31),
 ('queso cabrales', 22),
 ('queso manchego la pastora', 86),
 ('konbu', 24),
 ('tofu', 35),
 ('genen shouyu', 39)]

#### 2- Select all the products that have alteast 20 units in stock and have suppliers from either Lyngby, Paris or Sao Paulo [2 Marks]

In [4]:
%%time
%%sql
select productname, unitsInStock, companyname, city
from products p join suppliers s using(supplierID)
where p.unitsInStock >=20 and s.city in ('lyngby','paris','sao paulo')
limit 10;

 * postgresql://postgres:***@127.0.0.1:5432/Northwind1
3 rows affected.
Wall time: 16 ms

[('guaraná fantástica', 20, 'refrescos americanas ltda', 'sao paulo'),
 ('chartreuse verte', 69, 'aux joyeux ecclésiastiques', 'paris'),
 ('spegesild', 95, 'lyngbysild', 'lyngby')]

#### 3- Find out the top 10 Cities (Customer Cities) w.r.t to quantity of sold Beverages (Category Name)[5 Marks]

In [5]:
%%time
%%sql
select cu.city, sum(od.quantity) as quantity
from order_details od join products p using(productID) join categories c using(categoryID) join orders o using(orderID) join customers cu using(customerID)
where categoryname = 'beverages'
group by cu.city
order by sum(od.quantity) desc
limit 10;

 * postgresql://postgres:***@127.0.0.1:5432/Northwind1
10 rows affected.
Wall time: 23.9 ms

[('cunewalde', 886),
 ('boise', 827),
 ('graz', 822),
 ('sao paulo', 462),
 ('london', 402),
 ('rio de janeiro', 384),
 ('méxico d.f.', 295),
 ('bräcke', 294),
 ('san cristóbal', 273),
 ('luleå', 255)]

#### 4- Find out the top 5 Categories of Products sold in London and their Quatity [5 Marks]

In [6]:
%%time
%%sql
select categoryname, max(city) city, sum(od.quantity) as quantity
from order_details od join products p using(productID) join categories c using(categoryID) join orders o using(orderID) join customers cu using(customerID)
where city = 'london'
group by categoryname
order by sum(od.quantity) desc
limit 10;

 * postgresql://postgres:***@127.0.0.1:5432/Northwind1
8 rows affected.
Wall time: 16 ms

[('dairy products', 'london', 603),
 ('beverages', 'london', 402),
 ('confections', 'london', 311),
 ('grains/cereals', 'london', 292),
 ('seafood', 'london', 280),
 ('produce', 'london', 229),
 ('meat/poultry', 'london', 170),
 ('condiments', 'london', 160)]

#### 5- Find out the shippent company who delivered maximum orders in the 3rd Month of 1997. [3 Marks]

In [7]:
%%time
%%sql
select s.companyname, sum(od.quantity) as order_count
from order_details od join orders o using(orderID) join shippers s on (s.shipperID = o.shipvia)
where requireddate between '1997-03-01' and '1997-03-31'
group by s.companyname
order by sum(od.quantity) desc
limit 1;

 * postgresql://postgres:***@127.0.0.1:5432/Northwind1
1 rows affected.
Wall time: 8.03 ms

[('united package', 1022)]